I've discovered a bug.
If I pass an external group from AD in uppercase, I get this error.
The same group in lower case is added normally, in AD this test group is created in upper case.
I think that it is possible to add to the source code, to work with AD automatic transfer to the lower case of this variable.

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # freeipa_group.external_group will be created
  + resource "freeipa_group" "external_group" {
      + external = true
      + id       = (known after apply)
      + name     = "ad_test_admins_ext"
      + nonposix = false
    }

  # freeipa_group.internal_group will be created
  + resource "freeipa_group" "internal_group" {
      + external = false
      + id       = (known after apply)
      + name     = "ad_test_admins_int"
      + nonposix = false
    }

  # freeipa_user_group_membership.add_ext_group will be created
  + resource "freeipa_user_group_membership" "add_ext_group" {
      + external_member = "HR.TEST@example.local.corp"
      + id              = (known after apply)
      + name            = (known after apply)
    }

  # freeipa_user_group_membership.add_int_group will be created
  + resource "freeipa_user_group_membership" "add_int_group" {
      + group = (known after apply)
      + id    = (known after apply)
      + name  = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

freeipa_group.external_group: Creating...
freeipa_group.internal_group: Creating...
freeipa_group.external_group: Creation complete after 1s [id=ad_test_admins_ext]
freeipa_group.internal_group: Creation complete after 1s [id=ad_test_admins_int]
freeipa_user_group_membership.add_int_group: Creating...
freeipa_user_group_membership.add_ext_group: Creating...
freeipa_user_group_membership.add_int_group: Creation complete after 1s [id=ad_test_admins_int/g/ad_test_admins_ext]
╷
│ Error: Provider produced inconsistent result after apply
│
│ When applying changes to freeipa_user_group_membership.add_ext_group, provider "provider[\"registry.terraform.io/rework-space-com/freeipa\"]" produced an
│ unexpected new value: Root object was present, but now absent.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # freeipa_group.external_group will be created
  + resource "freeipa_group" "external_group" {
      + external = true
      + id       = (known after apply)
      + name     = "ad_test_admins_ext"
      + nonposix = false
    }

  # freeipa_group.internal_group will be created
  + resource "freeipa_group" "internal_group" {
      + external = false
      + id       = (known after apply)
      + name     = "ad_test_admins_int"
      + nonposix = false
    }

  # freeipa_user_group_membership.add_ext_group will be created
  + resource "freeipa_user_group_membership" "add_ext_group" {
      + external_member = "hr.test@example.local.corp"
      + id              = (known after apply)
      + name            = (known after apply)
    }

  # freeipa_user_group_membership.add_int_group will be created
  + resource "freeipa_user_group_membership" "add_int_group" {
      + group = (known after apply)
      + id    = (known after apply)
      + name  = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

freeipa_group.external_group: Creating...
freeipa_group.internal_group: Creating...
freeipa_group.external_group: Creation complete after 1s [id=ad_test_admins_ext]
freeipa_group.internal_group: Creation complete after 1s [id=ad_test_admins_int]
freeipa_user_group_membership.add_int_group: Creating...
freeipa_user_group_membership.add_ext_group: Creating...
freeipa_user_group_membership.add_int_group: Creation complete after 1s [id=ad_test_admins_int/g/ad_test_admins_ext]
freeipa_user_group_membership.add_ext_group: Creation complete after 2s [id=ad_test_admins_ext/e/hr.test@example.local.corp]
```